Public Member Functions | Friends | List of all members
IFCAPI::PropertySingleValue Class Referencefinal
IFC Data Access
Represents an IfcPropertySingleValue. More...
#include <IFCProperty.hpp>
 Inheritance diagram for IFCAPI::PropertySingleValue:
 Public Member Functions
IFCAPI::Value  | GetNominalValue () const
Get the property value.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Friends
 class  | Property
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
Represents an IfcPropertySingleValue.
Since
Archicad 28